BO/lib/itaPHPHWS/reqProtocolloIngresso.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:hpr="http://hproto.me.org/">
    <soap:Header/>
    <soap:Body>
        <hpr:ProtocollazioneIngresso>
            <!--Optional:-->
            <reqProtocollo>
                <!--type: int-->
                <accesso>1</accesso>
                <!--type: int-->
                <anno>2012</anno>
                <!--type: int-->
                <aoo>1</aoo>
                <!--type: int-->
                <classificazione>8992</classificazione>
                <!--type: int-->
                <codice>0</codice>
                <!--type: int-->
                <codiceOperatore>123</codiceOperatore>
                <!--type: int-->
                <codiceSpedizione>8</codiceSpedizione>
                <!--type: int-->
                <comunicazioneInterna>0</comunicazioneInterna>
                <!--type: int-->
                <corrispondente>22</corrispondente>
                <!--Optional:-->
            <!--type: dateTime-->
                <dataDocumento>2008-09-29T03:49:45</dataDocumento>
                <!--Optional:-->
            <!--type: dateTime-->
                <dataRegistrazione>2014-09-19T01:18:33</dataRegistrazione>
                <!--Optional:-->
            <!--type: dateTime-->
                <dataScadenza></dataScadenza>
                <!--type: int-->
                <flagCartaceo>0</flagCartaceo>
                <!--type: int-->
                <flagInArchivio>0</flagInArchivio>
                <!--Optional:-->
            <!--type: string-->
                <note>note varie</note>
                <!--type: int-->
                <numero>0</numero>
                <!--type: int-->
                <numeroAllegati>3</numeroAllegati>
                <!--Optional:-->
            <!--type: string-->
                <oggetto>test protocollo ingresso</oggetto>
                <!--type: int-->
                <protocolloCollegato>0</protocolloCollegato>
                <!--type: int-->
                <protocolloEmergenza>0</protocolloEmergenza>
                <!--type: int-->
                <protocolloRiscontro>3</protocolloRiscontro>
                <!--Optional:-->
            <!--type: string-->
                <segnatura>fremunt celsa</segnatura>
                <!--type: int-->
                <statoPratica>3</statoPratica>
                <!--type: int-->
                <statoProtocollo>3</statoProtocollo>
                <!--type: int-->
                <tipo>3</tipo>
                <!--type: int-->
                <ufficio>3</ufficio>
                <!--type: int-->
                <casellaMittente>3</casellaMittente>
                <!--Optional:-->
            <!--type: dateTime-->
                <dataArrivo>2012-09-13T15:00:34+02:00</dataArrivo>
                <!--Optional:-->
            <!--type: dateTime-->
                <dataProtocolloMittente>2009-10-14T09:16:36</dataProtocolloMittente>
                <!--Optional:-->
            <!--type: string-->
                <numeroProcolloMittente>flammato secum dea</numeroProcolloMittente>
            </reqProtocollo>
        </hpr:ProtocollazioneIngresso>
    </soap:Body>
</soap:Envelope>