BO/lib/itaPHPHWS/reqProtocolloUscita.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:hpr="http://hproto.me.org/">
    <soap:Header/>
    <soap:Body>
        <hpr:ProtocollazioneUscita>
            <!--Optional:-->
            <reqProtocollo>
                <!--type: int-->
                <accesso>3</accesso>
                <!--type: int-->
                <anno>3</anno>
                <!--type: int-->
                <aoo>3</aoo>
                <!--type: int-->
                <classificazione>3</classificazione>
                <!--type: int-->
                <codice>3</codice>
                <!--type: int-->
                <codiceOperatore>3</codiceOperatore>
                <!--type: int-->
                <codiceSpedizione>3</codiceSpedizione>
                <!--type: int-->
                <comunicazioneInterna>3</comunicazioneInterna>
                <!--type: int-->
                <corrispondente>3</corrispondente>
                <!--Optional:-->
            <!--type: dateTime-->
                <dataDocumento>2008-09-29T03:49:45</dataDocumento>
                <!--Optional:-->
            <!--type: dateTime-->
                <dataRegistrazione>2014-09-19T01:18:33</dataRegistrazione>
                <!--Optional:-->
            <!--type: dateTime-->
                <dataScadenza>2006-08-19T19:27:14+02:00</dataScadenza>
                <!--type: int-->
                <flagCartaceo>3</flagCartaceo>
                <!--type: int-->
                <flagInArchivio>3</flagInArchivio>
                <!--Optional:-->
            <!--type: string-->
                <note>turbine corripuit</note>
                <!--type: int-->
                <numero>3</numero>
                <!--type: int-->
                <numeroAllegati>3</numeroAllegati>
                <!--Optional:-->
            <!--type: string-->
                <oggetto>regemque dedit</oggetto>
                <!--type: int-->
                <protocolloCollegato>3</protocolloCollegato>
                <!--type: int-->
                <protocolloEmergenza>3</protocolloEmergenza>
                <!--type: int-->
                <protocolloRiscontro>3</protocolloRiscontro>
                <!--Optional:-->
            <!--type: string-->
                <segnatura>fremunt celsa</segnatura>
                <!--type: int-->
                <statoPratica>3</statoPratica>
                <!--type: int-->
                <statoProtocollo>3</statoProtocollo>
                <!--type: int-->
                <tipo>3</tipo>
                <!--type: int-->
                <ufficio>3</ufficio>
            </reqProtocollo>
        </hpr:ProtocollazioneUscita>
    </soap:Body>
</soap:Envelope>